<a href="https://colab.research.google.com/github/Bhavya-2724/DataAcademy-Bhavya/blob/main/Practice_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

How to change list into dictionary

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
a_list = ['abcd']
np_array = np.arange(1,10)
dict_1 = {"A":0,"B":1,"C":2,"D":3,"E":4 }

In [ ]:
a_list

['abcd']

In [ ]:
np_array

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [ ]:
series_1 = pd.Series(a_list)
series_2 = pd.Series(np_array)
series_3 = pd.Series(dict_1)

In [ ]:
series_3

A    0
B    1
C    2
D    3
E    4
dtype: int64

How to combine series to form dataframe

In [ ]:
df = pd.DataFrame(series_1)

In [ ]:
df

      0
0  abcd

In [ ]:
df = pd.DataFrame(series_3)

In [ ]:
df

   0
A  0
B  1
C  2
D  3
E  4

In [ ]:
ser_1 = pd.Series(list("abcdefghijklmnopqrstuvwxyz"))
ser_2 = pd.Series(np.arange(26))

In [ ]:
series_df = pd.DataFrame(ser_1,ser_2).reset_index()
series_df

    index  0
0       0  a
1       1  b
2       2  c
3       3  d
4       4  e
5       5  f
6       6  g
7       7  h
8       8  i
9       9  j
10     10  k
11     11  l
12     12  m
13     13  n
14     14  o
15     15  p
16     16  q
17     17  r
18     18  s
19     19  t
20     20  u
21     21  v
22     22  w
23     23  x
24     24  y
25     25  z

In [35]:
ser_dict = pd.DataFrame({"Col1":ser_2, "Col2":ser_2})

In [36]:
ser_dict

    Col1  Col2
0      0     0
1      1     1
2      2     2
3      3     3
4      4     4
5      5     5
6      6     6
7      7     7
8      8     8
9      9     9
10    10    10
11    11    11
12    12    12
13    13    13
14    14    14
15    15    15
16    16    16
17    17    17
18    18    18
19    19    19
20    20    20
21    21    21
22    22    22
23    23    23
24    24    24
25    25    25

In [40]:
series_lst = pd.concat([ser_1,ser_2],axis = 1)

In [41]:
series_lst

    0   1
0   a   0
1   b   1
2   c   2
3   d   3
4   e   4
5   f   5
6   g   6
7   h   7
8   i   8
9   j   9
10  k  10
11  l  11
12  m  12
13  n  13
14  o  14
15  p  15
16  q  16
17  r  17
18  s  18
19  t  19
20  u  20
21  v  21
22  w  22
23  x  23
24  y  24
25  z  25

In [46]:
df.iloc[4:5]

   0
E  4